INSERT INTO
    `genres` (g_name)
VALUES
    ('Поэзия'),
    ('Программирование'),
    ('Психология'),
    ('Наука'),
    ('Классика'),
    ('Фантастика');

INSERT INTO
    `subscribers` (s_name)
VALUES
    ('Иванов И.И.'),
    ('Петров П.П.'),
    ('Сидоров С.С.'),
    ('Сидоров С.С.');

INSERT INTO
    `books` (b_name, b_year, b_quantity)
VALUES
    ('Евгений Онегин', 1985, 2),
    ('Сказака о рыбаке и рыбке', 1990, 3),
    ('Основание и империя', 2000, 5),
    ('Психология программирования', 1998, 1),
    ('Язык программирования C++', 1996, 3),
    ('Курс теоретической физики', 1981, 12),
    ('Искусство программирования', 1993, 7);

INSERT INTO
    `authors` (a_name)
VALUES
    ('Д. Кнут'),
    ('А. Азимов'),
    ('Д. Карнеги'),
    ('Л.Д. Ландау'),
    ('Е.М. Лифшиц'),
    ('Б. Страуструп'),
    ('А.С. Пушкин');

INSERT INTO
    `books_authors` (b_id, a_id)
VALUES
    (1, 7),
    (2, 7),
    (3, 2),
    (4, 3),
    (4, 6),
    (5, 6),
    (6, 5),
    (6, 4),
    (7, 1);

INSERT INTO
    `books_genres` (b_id, g_id)
VALUES
    (1, 1),
    (1, 5),
    (2, 1),
    (2, 5),
    (3, 6),
    (4, 2),
    (4, 3),
    (5, 2),
    (6, 5),
    (7, 3),
    (7, 5);

INSERT INTO
    `subscriptions` (
        sb_subscriber,
        sb_book,
        sb_start,
        sb_finish,
        sb_is_active
    )
VALUES
    (1, 3, 2011-01-12, 2011-02-12, 0),
    (1, 1, 2011-01-12, 2011-02-12, 0),
    (3, 3, 2012-05-17, 2012-07-17, 1),
    (1, 2, 2012-06-11, 2012-08-11, 0),
    (4, 5, 2012-06-11, 2012-08-11, 0),
    (1, 7, 2014-08-03, 2014-10-03, 0),
    (3, 5, 2014-08-03, 2014-10-03, 1),
    (3, 1, 2014-08-03, 2014-09-03, 1),
    (4, 1, 2015-10-07, 2015-03-07, 1),
    (1, 4, 2015-10-07, 2015-11-07, 0),
    (4, 4, 2015-10-08, 2025-11-08, 1);